[
  {
    "name": "📍<i class=\"featured\">pinned project</i> <br/> Unda - Open-Source Machine Learning Library in Rust from Scratch 🌊",
    "descr": [
      "Led the development of the <i>Unda</i> machine learning library in Rust, designed for efficient execution of machine learning workloads.",
      "Engineered an intermediate API for constructing neural networks using a sequence of computation nodes within a custom compute graph.",
      "Integrated XLA bindings in Rust to dynamically compile and optimize compute graphs for accelerated execution.",
      "Developed a high-level API to facilitate the creation of supervised machine learning models, with ongoing work on unsupervised and generative models.",
      "Unda achieved 4th place in the 2024 MSOE ROSIE Supercomputer Challenge, demonstrating its effectiveness in large-scale ML tasks."
    ],
    "extra": [
      "<b>Unda was a part of the 2024 MSOE ROSIE Supercomputer challenge and ranked 4th place overall!!</b>",
      "<a href=\"https://github.com/unda-ml/unda\" target=\"_blank\">Star Unda on GitHub</a>"
    ]
  },
  {
    "name": "Chromogotchi - Tamagotchi Living in a Chrome Extension",
    "descr": [
      "Utilizing GoLang, created a virtual pet chrome extension with a mongodb managed state",
      "Developed websocket listener server in Go that could interact with a pet's state by feeding, playing with, and putting to sleep",
      "Created lightweight Chrome extension that communicates with Heroku-hosted Go server to display the pet directly in the browser"
    ],
    "extra": [
      "<a href=\"https://github.com/BradenEverson/chromogotchi\">GitHub Repo</a>"
    ]
  },
  {
    "name": "td - Tower Defense Game in Rust 🏗️",
    "descr": [
      "Developed a real-time, WebSocket-enabled tower defense game with a focus on multiplayer interactions.",
      "Implemented a WebSocket server in Rust to handle real-time game state synchronization across multiple clients.",
      "Designed an asynchronous server flow optimized for performance and low latency in a multiplayer environment.",
      "Utilized TypeScript for the frontend to manage game state, render animations, and handle user inputs on an HTML5 canvas."
    ],
    "extra": ["<a href=\"https://github.com/BradenEverson/td\">GitHub Repo</a>"]
  },
  {
    "name": "wunos - Rust-Based Uno Game Server 🃏",
    "descr": [
      "Developed a WebSocket-based server for playing Uno, written in Rust to ensure high performance and low latency.",
      "Implemented the game logic, including rules enforcement and turn management, in a scalable, event-driven architecture.",
      "Created a robust system for managing player connections, game state, and real-time interactions.",
      "Integrated with a custom WebSocket client to provide a seamless multiplayer Uno experience.",
      "Developed an intuitive and charming TUI for playing Uno directly from the terminal."
    ],
    "extra": [
      "<a href=\"https://github.com/BradenEverson/wunos\">GitHub Repo</a>"
    ]
  },
  {
    "name": "Embedded Machine Learning - Predictive Heart Attack Monitor 💓",
    "descr": [
      "Utilized the <a href=\"https://github.com/unda-ml/unda\">Unda library</a> to train a dense neural network on the <a href=\"https://www.kaggle.com/datasets/rashikrahmanpritom/heart-attack-analysis-prediction-dataset\">Heart Attack Analysis Prediction Dataset</a> from Kaggle.",
      "Achieved a 96.08% accuracy rate using a model with approximately 512 parameters.",
      "Exported the trained model as a custom .unda file for embedded use, enabling real-time inference on an ESP32-based circuit.",
      "Developed firmware in Rust for the ESP32, integrating peripherals such as a heart rate sensor and LEDs to signal model predictions, housed within a custom 3D-printed case."
    ],
    "extra": [
      "<b>This project was showcased at the 2024 MSOE ROSIE Supercomputer challenge and ranked 4th place overall!!</b>",
      "<a href=\"https://github.com/BradenEverson/unda-heart-embedded\">Embedded Source Code</a>",
      "<a href=\"https://github.com/BradenEverson/unda-heart-attack-dnn\">Model Source Code</a>"
    ]
  },
  {
    "name": "Embedded Machine Learning - Automated Plant Care ☀️💧",
    "descr": [
      "Leveraged the <a href=\"https://github.com/unda-ml/unda\">Unda library</a> to develop a predictive model trained on sun exposure, soil moisture, and time since last watering to automate plant care.",
      "Designed and integrated an ESP32-based embedded system that controls a water pump, moisture sensor, light sensor, and servo motor for plant care automation.",
      "Trained a model with over 350,000 parameters, optimized using a supercomputer and exported as a custom .unda file for embedded deployment.",
      "Implemented firmware in Rust for the ESP32, enabling the system to autonomously manage watering and shading based on model predictions."
    ],
    "extra": [
      "<b>This project was showcased at the 2024 MSOE ROSIE Supercomputer challenge and ranked 4th place overall!!</b>",
      "<a href=\"https://github.com/BradenEverson/unda-garden-embedded\">Embedded Source Code</a>",
      "<a href=\"https://github.com/BradenEverson/eden-model\">Model Source Code</a>"
    ]
  },
  {
    "name": "SiteSmith - Rust CLI Tool for Generating Personal Websites 🛠️",
    "descr": [
      "Developed SiteSmith, a Rust-based CLI tool that automates the generation of personal websites using JSON-formatted project and work experience data.",
      "Implemented features for parsing JSON data and generating HTML websites from customizable templates.",
      "Published the tool on Cargo, making it publicly available for developers seeking to automate the creation of personal websites."
    ],
    "extra": [
      "<b>This website was generated using SiteSmith!</b>",
      "<a href=\"https://github.com/BradenEverson/sitesmith\">Source Code</a>"
    ]
  },
  {
    "name": "Machine Learning Drones - Embedded Deep Learning 🦾",
    "descr": [
      "Developing and implementing an autonomous drone capable of responding to hand signals using embedded deep learning algorithms.",
      "Designed and trained a convolutional neural network for computer vision and path decision-making, enabling dynamic flight pattern adjustments.",
      "Created a lightweight embedded Rust library to parse precompiled model weights and biases, enabling on-device inference with minimal resource consumption.",
      "Developed a custom file format for compact storage of machine learning models, optimized for memory-constrained embedded systems."
    ],
    "extra": []
  },
  {
    "name": "Senior Capstone - Smart IoT Gardening Systems 🪴",
    "descr": [
      "Developed a smart gardening system that autonomously monitors and maintains plant health through IoT-enabled sensors and actuators.",
      "Integrated soil moisture, temperature, and light sensors to dynamically adjust watering schedules and alert users to potential issues.",
      "Connected the system to a mobile app, providing real-time data and remote control over the gardening environment.",
      "Leveraged machine learning algorithms to predict optimal watering times and amounts, enhancing garden management efficiency."
    ],
    "extra": []
  }
]
