[
    {
        "name": "Firmware Engineering Intern",
        "location": "Milwaukee Tool",
        "timespan": "May 2025 - August 2025",
        "descr": [
            "Worked on the Platform Electronics - Tool Intelligence FW team",
            "Investigated BLE features including Periodic Advertising and Broadcast Isochronous Streams and their uses in Tool BLE Firmware",
            "Propsed and Designed systems for complex Firmware BLE systems and topologies"
        ],
        "extra": []
    },
    {
        "name": "Embedded Software Engineering Intern",
        "location": "Cognex Corporation",
        "timespan": "May 2024 - May 2025",
        "descr": [
            "Researched and integrating Rust into a large CMake-based C++/C codebase, replacing an in-house HTTP server implementation responsible for multiple user-facing crashes due to memory related issues.",
            "Utilized the Corrosion crate and cxx for seamless C++ and Rust interoperability, ensuring smooth integration into the existing codebase.",
            "Leveraged Rust's memory safety to architect a robust and crash-resistant HTTP server, improving system stability while maintaining performace deltas.",
            "Implemented WebSocket upgrade protocols in Rust, enabling more modern features within the server.",
            "Utilized asynchronous Rust for thread-safe, optimized server management, ensuring efficient handling of multiple connections.",
            "Developed and executed unit and integration tests in both Rust and C++ to validate compatibility with existing FFI consumers."
        ],
        "extra": []
    },
    {
        "name": "Full Stack .NET Developer Intern",
        "location": "FitX On Demand",
        "timespan": "January 2023 - August 2023",
        "descr": [
            "Developed cloud-based IoT solution for remote access QR codes that can scan into fitness content.",
            "Implemented secure zone identifier that bans video access if scan location is out of range from the designated hotel/gym.",
            "Leveraged AWS S3 buckets to host video content securely with limited endpoints open.",
            "Developed data visualization through QR code scan location statistics on a map along with dynamic QR code disabling based on how much variety these scan locations carried."
        ],
        "extra": []
    },
    {
        "name": "Full Stack .NET Contract Developer",
        "location": "BrightBean Labs",
        "timespan": "November 2020 - January 2023",
        "descr": [
            "Developed Asp.Net web applications and Xamarin Forms mobile applications for clients seeking unique software solutions in the .Net space.",
            "Developed Denver Health DHREM scheduling platform: an Asp.Net built application providing continuously integrated scheduling services in real time for Denver Health resident interns.",
            "Used Xamarin forms and MVC architecture to develop an IoT mobile solution for smart truck engine warmers that could be dynamically controlled through the app."
        ],
        "extra": []
    }
]
